{
  "backend/main.mo": "Actor implementing user profiles, habit creation with categories, completions tracking, and access‑controlled CRUD operations.",
  "backend/migration.mo": "Migration module converting old habit records by assigning a default category and returning an updated actor state.",
  "feature_evidence.json": "Evidence report linking features to the frontend files, components, and requirements they fulfill.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all major frontend components and utilities.",
  "frontend/index.html": "HTML entry file setting up metadata, favicon links, and loading the main React bundle.",
  "frontend/src/App.tsx": "Main UI logic handling authentication, habit filtering by category, habit creation, and overall app layout.",
  "frontend/src/components/CreateHabitModal.tsx": "Modal UI for creating a habit with name, color, and category selection plus error handling.",
  "frontend/src/components/EditDisplayNameModal.tsx": "Modal for editing a user's display name with validation and loading/error states.",
  "frontend/src/components/EditHabitModal.tsx": "Modal for editing a habit’s name, color, and category with preset options and form submission handling.",
  "frontend/src/components/HabitCard.tsx": "Displays a habit card with editing, deletion, completion toggling, and a two‑week completion grid.",
  "frontend/src/components/HabitHistoryModal.tsx": "Modal showing six months of calendar‑style habit completion history using generated month/week grids.",
  "frontend/src/components/ProfileSection.tsx": "Profile UI handling login, display name editing, dropdown actions, and sign‑out behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useEnsureUserRole.ts": "Ensures the authenticated user is assigned the user role by calling the backend once per session.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout functions, and identity persistence via context.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, habits, completions, and related updates using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles, custom animations, scrollbar styling, focus styles, and transitions.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the root component.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/src/utils/userFacingErrors.ts": "Converts backend error messages into friendly, user-readable strings with basic categorization.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths and extending the theme with custom fonts.",
  "project_state.json": "Project metadata defining features, requirements, and current state for the habit categories update."
}