{
  "kind": "build_request",
  "title": "Add habit categories",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the habit data model to include a category field, and update all habit CRUD methods to persist and return the category for each habit.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add habbit catagories"
        ]
      },
      "acceptanceCriteria": [
        "The backend Habit type includes a Text category field.",
        "createHabit accepts a category value and stores it with the habit.",
        "updateHabit supports updating the category for an existing habit.",
        "getHabits returns each habit with its category populated.",
        "All updated methods enforce the existing access-control checks (no permission regressions)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a safe default category for existing stored habits so the canister can upgrade without losing prior habit data.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add habbit catagories"
        ]
      },
      "acceptanceCriteria": [
        "On upgrade, any existing habits without a category are assigned a default category (e.g., \"Personal\").",
        "After upgrade, previously created habits still appear in the UI and have a non-empty category.",
        "No migration is generated/used unless needed by the existing persisted state (follow the conditional migration policy)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the habit create flow UI to allow selecting a habit category, and submit the selected category when creating a habit.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add habbit catagories"
        ]
      },
      "acceptanceCriteria": [
        "Create Habit modal includes a \"Category\" input (English label) with sensible defaults (at minimum: Health, Work, Personal).",
        "Creating a habit sends name, color, and category, and the created habit shows up with its category preserved after refresh.",
        "User-facing text is in English and matches the existing UI tone."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the habit edit flow UI to allow changing a habit category, and submit the selected category when saving edits.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add habbit catagories"
        ]
      },
      "acceptanceCriteria": [
        "Edit Habit modal includes a \"Category\" input prefilled with the habit’s current category.",
        "Saving edits persists the updated category and it is visible after refetch/reload.",
        "No regressions to existing edit functionality (name/color) or loading/disabled states."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Display habit categories in the main habits view so users can visually distinguish and organize habits by category.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add habbit catagories"
        ]
      },
      "acceptanceCriteria": [
        "Each HabitCard displays the habit category (e.g., as a small label/badge) without breaking the current layout.",
        "The habits list is grouped by category or provides a category filter control (choose one approach) to help users organize habits.",
        "The UI remains usable on mobile and desktop layouts already supported by the app."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update the frontend’s backend type usage and React Query hooks/mutations to match the updated backend habit/category API.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add habbit catagories"
        ]
      },
      "acceptanceCriteria": [
        "TypeScript types used for Habit include category and compile without type errors.",
        "useCreateHabit and useUpdateHabit send/accept category where needed and invalidate the same queries as before.",
        "No changes are made to read-only/immutable hook files listed by the system constraints."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with logic in backend/main.mo.",
    "Follow the conditional migration policy: create/update backend/migration.mo only if upgrading existing persisted state requires it.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths; compose existing UI components instead.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding reminders/notifications.",
    "Adding streak counters or analytics views.",
    "Adding third-party authentication (only Internet Identity is supported).",
    "Adding external databases or multiple backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}